terjeio/grblHAL/drivers/ESP32/driver.c
/*
  driver.c - An embedded CNC Controller with rs274/ngc (g-code) support

  Driver code for ESP32

  Part of Grbl

  Copyright (c) 2018 Terje Io

  Some parts
   Copyright (c) 2011-2015 Sungeun K. Jeon
   Copyright (c) 2009-2011 Simen Svale Skogsrud

  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.
*/

#include <stdint.h>
#include <stdbool.h>

#include "GRBL/grbl.h"
#include "GRBL/report.h"

#include "driver.h"
//#include "eeprom.h"
#include "esp32-hal-uart.h"
#include "serial.h"
#include "nvs.h"
#include "esp_log.h"
#ifdef WIFI_ENABLE
#include "wifi.h"
#include "TCPSTream.h"
#endif

#ifdef BLUETOOTH_ENABLE
#include "bluetooth.h"
#endif

#ifdef SDCARD_ENABLE
#include "sdcard.h"
#endif

#ifdef IOEXPAND_ENABLE
#include "ioexpand.h"
#endif

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/timers.h"

// prescale step counter to 20Mhz
#define STEPPER_DRIVER_PRESCALER 4

#ifdef PWM_RAMPED

#define SPINDLE_RAMP_STEP_INCR 20 // timer compare register change per ramp step
#define SPINDLE_RAMP_STEP_TIME 2  // ms

typedef struct {
    volatile uint32_t ms_cfg;
    volatile uint32_t ms_count;
    uint32_t pwm_current;
    uint32_t pwm_target;
    uint32_t pwm_step;
} pwm_ramp_t;

static pwm_ramp_t pwm_ramp;
#endif

static driver_settings_t driver_settings;

typedef struct {
    uint8_t pin;
    uint8_t group;
    uint32_t mask;
    uint8_t offset;
    bool invert;
    volatile bool active;
    volatile bool debounce;
} state_signal_t;

#define INPUT_GROUP_CONTROL 1
#define INPUT_GROUP_PROBE   2
#define INPUT_GROUP_LIMIT   4
/*
#define INPUT_RESET         0
#define INPUT_FEED_HOLD     1
#define INPUT_CYCLE_START   2
#define INPUT_SAFETY_DOOR   3
#define INPUT_PROBE         4
#define INPUT_LIMIT_X       5
#define INPUT_LIMIT_Y       6
#define INPUT_LIMIT_Z       7

state_signal_t inputpin[] = {
    { .pin = RESET_PIN, .group = INPUT_GROUP_CONTROL },
    { .pin = FEED_HOLD_PIN, .group = INPUT_GROUP_CONTROL },
    { .pin = CYCLE_START_PIN, .group = INPUT_GROUP_CONTROL },
    { .pin = SAFETY_DOOR_PIN, .group = INPUT_GROUP_CONTROL },
    { .pin = PROBE_PIN, .group = INPUT_GROUP_PROBE },
    { .pin = X_LIMIT_PIN, .group = INPUT_GROUP_LIMIT },
    { .pin = Y_LIMIT_PIN, .group = INPUT_GROUP_LIMIT },
    { .pin = Z_LIMIT_PIN, .group = INPUT_GROUP_LIMIT }
};
*/

#define INPUT_FEED_HOLD     0
#define INPUT_CYCLE_START   1
#define INPUT_LIMIT_Y       2

#define INPUT_RESET         3
#define INPUT_SAFETY_DOOR   4
#define INPUT_PROBE         5
#define INPUT_LIMIT_X       6
#define INPUT_LIMIT_Z       7

state_signal_t inputpin[] = {
		{ .pin = FEED_HOLD_PIN, .group = INPUT_GROUP_CONTROL },
	    { .pin = CYCLE_START_PIN, .group = INPUT_GROUP_CONTROL },
    { .pin = Y_LIMIT_PIN, .group = INPUT_GROUP_LIMIT }
};

static volatile uint32_t ms_count = 1; // NOTE: initial value 1 is for "resetting" systick timer
static bool pwmEnabled = false, IOInitDone = false;
static spindle_pwm_t spindle_pwm;

// Inverts the probe pin state depending on user settings and probing cycle mode.
static uint8_t probe_invert;

#ifdef IOEXPAND_ENABLE
static ioexpand_t iopins = {0};
#endif

static uint_fast16_t spindleSetSpeed (uint_fast16_t pwm_value);

static portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;

static ledc_timer_config_t ledTimerConfig = {
	.speed_mode = LEDC_HIGH_SPEED_MODE,
	.duty_resolution = LEDC_TIMER_10_BIT,
	.timer_num = LEDC_TIMER_0,
	.freq_hz = (uint32_t)DEFAULT_SPINDLE_PWM_FREQ
};

static ledc_channel_config_t ledConfig = {
	.gpio_num = SPINDLEPWMPIN,
    .speed_mode = LEDC_HIGH_SPEED_MODE,
    .channel = LEDC_CHANNEL_0,
    .intr_type = LEDC_INTR_DISABLE,
    .timer_sel = LEDC_TIMER_0,
    .duty = 0,  /*!< LEDC channel duty, the range of duty setting is [0, (2**duty_resolution)] */
    .hpoint = 0
};
// Interrupt handler prototypes
static void stepper_driver_isr (void *arg);
static void gpio_isr (void *arg);

static TimerHandle_t xDelayTimer = NULL, debounceTimer = NULL;
static TaskHandle_t xStepperTask = NULL;

#ifdef BLUETOOTH_ENABLE
bool btStreamPutC (const char c)
{
	BTStreamPutC(c);
	uartPutC(c);

    return true;
}

void btStreamWriteS (const char *data)
{
	BTStreamWriteS(data);
	uartWriteS(data);
}
#endif

#ifdef WIFI_ENABLE
bool wifiStreamPutC (const char c)
{
	TCPStreamPutC(c);
	uartPutC(c);

    return true;
}

void wifiStreamWriteS (const char *data)
{
	TCPStreamWriteS(data);
	uartWriteS(data);
}
#endif

void selectStream (stream_setting_t stream)
{
	//
    switch(stream) {
#ifdef BLUETOOTH_ENABLE
        case StreamSetting_Bluetooth:
            hal.serial_read = BTStreamGetC;
            hal.serial_write = btStreamPutC;
            hal.serial_write_string = btStreamWriteS;
            hal.serial_get_rx_buffer_available = BTStreamRXFree;
            hal.serial_reset_read_buffer = BTStreamFlush;
            hal.serial_cancel_read_buffer = BTStreamCancel;
            setBTReceiveCallback(hal.protocol_process_realtime);
            break;
#endif
#ifdef WIFI_ENABLE
        case StreamSetting_WiFi:
            hal.serial_read = TCPStreamGetC;
            hal.serial_write = wifiStreamPutC;
            hal.serial_write_string = wifiStreamWriteS;
            hal.serial_get_rx_buffer_available = TCPStreamRxFree;
            hal.serial_reset_read_buffer = TCPStreamRxFlush;
            hal.serial_cancel_read_buffer = TCPStreamRxCancel;
            TCPStreamSetReceiveCallback(hal.protocol_process_realtime);
        	hal.serial_write_string("[MSG:WIFI RUNNING]\r\n");
            break;
#endif
        case StreamSetting_Serial:
            hal.serial_read = uartRead;
            hal.serial_write = uartPutC;
            hal.serial_write_string = uartWriteS;
            hal.serial_get_rx_buffer_available = uartRXFree;
            hal.serial_reset_read_buffer = uartFlush;
            hal.serial_cancel_read_buffer = uartCancel;
            hal.serial_suspend_read = uartSuspendInput;
            setUARTReceiveCallback(hal.protocol_process_realtime);
            break;

        default:
        	break;
    }
}

