terjeio/grblHAL/drivers/ESP32/driver.c
                case INPUT_FEED_HOLD:
                	ie = true;
                    pullup = !settings->control_disable_pullup.feed_hold;
                    inputpin[i].invert = control_fei.feed_hold;
                    break;

                case INPUT_CYCLE_START:
                	ie = true;
                    pullup = !settings->control_disable_pullup.cycle_start;
                    inputpin[i].invert = control_fei.cycle_start;
                    break;

                case INPUT_SAFETY_DOOR:
                	ie = true;
                    pullup = !settings->control_disable_pullup.safety_door_ajar;
                    inputpin[i].invert = control_fei.safety_door_ajar;
                    break;

                case INPUT_PROBE:
                    pullup = hal.driver_cap.probe_pull_up;
                    inputpin[i].invert = false;
                    break;

                case INPUT_LIMIT_X:
                    pullup = !settings->limits.disable_pullup.x;
                    inputpin[i].invert = limit_fei.x;
                    break;

                case INPUT_LIMIT_Y:
                    pullup = !settings->limits.disable_pullup.y;
                    inputpin[i].invert = limit_fei.y;
                    break;

                case INPUT_LIMIT_Z:
                    pullup = !settings->limits.disable_pullup.z;
                    inputpin[i].invert = limit_fei.z;
                    break;
            }

            pullup = pullup && inputpin[i].pin < 34;

            gpio_intr_disable(inputpin[i].pin);

            config.pin_bit_mask = 1ULL << inputpin[i].pin;
            config.mode = GPIO_MODE_INPUT;
            config.pull_up_en = pullup ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE;
            config.pull_down_en = pullup ? GPIO_PULLDOWN_DISABLE : GPIO_PULLDOWN_ENABLE;
            config.intr_type = ie ? (inputpin[i].invert ? GPIO_INTR_NEGEDGE : GPIO_INTR_POSEDGE) : GPIO_INTR_DISABLE;

            inputpin[i].offset = config.pin_bit_mask > (1ULL << 31) ? 1 : 0;
            inputpin[i].mask = inputpin[i].offset == 0 ? (uint32_t)config.pin_bit_mask : (uint32_t)(config.pin_bit_mask >> 32);

//            printf("IN %d - %d -%d : %x\n", inputpin[i].pin,  inputpin[i].offset, inputpin[i].mask, inputpin[i].invert);

            gpio_config(&config);

            inputpin[i].active   = gpio_get_level(inputpin[i].pin) == (inputpin[i].invert ? 0 : 1);
            inputpin[i].debounce = hal.driver_cap.software_debounce;

        } while(i);
    }
}

void vStepperTask (void *pvParameters)
{
	while(true) {
		vTaskSuspend(NULL);
		hal.stepper_interrupt_callback();
	}
}

// Initializes MCU peripherals for Grbl use
static bool driver_setup (settings_t *settings)
{

	/********************************************************
	 * Read driver specific setting from persistent storage *
	 ********************************************************/

	if(hal.eeprom.type != EEPROM_None) {
		if(!hal.eeprom.memcpy_from_with_checksum((uint8_t *)&driver_settings, hal.eeprom.driver_area.address, sizeof(driver_settings)))
			hal.driver_settings_restore(SETTINGS_RESTORE_DRIVER_PARAMETERS);
	}

    /******************
     *  Stepper init  *
     ******************/

	timer_config_t timerConfig = {
		.divider     = STEPPER_DRIVER_PRESCALER,
		.counter_dir = TIMER_COUNT_UP,
		.counter_en  = TIMER_PAUSE,
		.alarm_en    = TIMER_ALARM_EN,
		.intr_type   = TIMER_INTR_LEVEL,
		.auto_reload = true
	};

	timer_init(STEP_TIMER_GROUP, STEP_TIMER_INDEX, &timerConfig);
	timer_set_counter_value(STEP_TIMER_GROUP, STEP_TIMER_INDEX, 0ULL);
	timer_isr_register(STEP_TIMER_GROUP, STEP_TIMER_INDEX, stepper_driver_isr, 0, ESP_INTR_FLAG_IRAM, NULL);
	timer_enable_intr(STEP_TIMER_GROUP, STEP_TIMER_INDEX);

	xTaskCreatePinnedToCore(vStepperTask, "Stepper", configMINIMAL_STACK_SIZE, NULL, configMAX_PRIORITIES, &xStepperTask, 1);

    /********************
     *  Output signals  *
     ********************/

    uint32_t channel;
    for(channel = 0; channel < N_AXIS; channel++)
        rmt_set_source_clk(channel, RMT_BASECLK_APB);

    // .pin_bit_mask = (1ULL << STEPPERS_DISABLE_PIN); //HWSTEP_MASK|HWDIRECTION_MASK|(1ULL << STEPPERS_DISABLE_PIN)|HWSPINDLE_MASK|HWCOOLANT_MASK;

    gpio_config_t gpioConfig = {
		.pin_bit_mask = 1ULL << 13,
		.mode = GPIO_MODE_OUTPUT,
		.pull_up_en = GPIO_PULLUP_DISABLE,
		.pull_down_en = GPIO_PULLDOWN_DISABLE,
		.intr_type = GPIO_INTR_DISABLE
    };

    gpio_config(&gpioConfig);

   /****************************
    *  Software debounce init  *
    ****************************/

    if(hal.driver_cap.software_debounce)
        debounceTimer = xTimerCreate("msDelay", pdMS_TO_TICKS(32), pdFALSE, NULL, debounceTimerCallback);

    /******************************************
     *  Control, limit & probe pins dir init  *
     ******************************************/

    gpio_isr_register(gpio_isr, NULL, (int)ESP_INTR_FLAG_IRAM, NULL);

#ifdef PWM_RAMPED
    ledc_fade_func_install(ESP_INTR_FLAG_IRAM);
#endif

   /******************
    *  Spindle init  *
    ******************/

    if((hal.driver_cap.variable_spindle)) {
    	ledConfig.speed_mode = ledTimerConfig.speed_mode;
    	ledc_timer_config(&ledTimerConfig);
    	ledc_channel_config(&ledConfig);
    } else
        hal.spindle_set_state = &spindleSetState;

#ifdef SDCARD_ENABLE
    sdcard_init();
#endif

#ifdef IOEXPAND_ENABLE
    ioexpand_init();
#endif

  // Set defaults

    IOInitDone = settings->version == 14;

    settings_changed(settings);

    spindleSetState((spindle_state_t){0}, spindle_pwm.off_value, DEFAULT_SPINDLE_RPM_OVERRIDE);
    coolantSetState((coolant_state_t){0});
    stepperSetDirOutputs((axes_signals_t){0});

    return IOInitDone;
}

static bool user_defined_setting (uint_fast16_t param, float value, char *svalue)
{
	bool claimed = false;

	if(svalue) switch(param) {

		case 71:
			claimed = strlcpy(driver_settings.wifi.ssid, svalue, sizeof(driver_settings.wifi.ssid)) <= sizeof(driver_settings.wifi.ssid);
			break;

		case 72:
			claimed = strlcpy(driver_settings.wifi.password, svalue, sizeof(driver_settings.wifi.password)) <= sizeof(driver_settings.wifi.password);
			break;

		case 73:
			if((claimed = (value != NAN && value > 0.0f && value < 65536.0f)))
				driver_settings.wifi.port = (uint16_t)value;
			break;

