terjeio/grblHAL/drivers/ESP32/driver.c
		case 74:
			claimed = strlcpy(driver_settings.bluetooth.device_name, svalue, sizeof(driver_settings.bluetooth.device_name)) <= sizeof(driver_settings.bluetooth.device_name);
			break;

		case 75:
			claimed = strlcpy(driver_settings.bluetooth.service_name, svalue, sizeof(driver_settings.bluetooth.service_name)) <= sizeof(driver_settings.bluetooth.service_name);
			break;
	}

	if(claimed) {
		hal.eeprom.memcpy_to_with_checksum(hal.eeprom.driver_area.address, (uint8_t *)&driver_settings, sizeof(driver_settings));
#ifdef EMULATE_EEPROM
	  if(hal.eeprom.type == EEPROM_Emulated)
		  settings_dirty.driver_settings = settings_dirty.is_dirty = true;
#endif
	}
    return claimed;
}

static void report_string_setting (uint8_t setting, char *value)
{
    hal.serial_write('$');
    print_uint8_base10(setting);
    hal.serial_write('=');
    hal.serial_write_string(value);
    hal.serial_write_string("\r\n");
}

static void driver_settings_report (bool axis_settings)
{
    if(!axis_settings) {
#ifdef WIFI_ENABLE
		report_string_setting(71, driver_settings.wifi.ssid);
		report_string_setting(72, driver_settings.wifi.password);
		report_util_uint_setting(73, driver_settings.wifi.port);
#endif
#ifdef BLUETOOTH_ENABLE
		report_string_setting(74, driver_settings.bluetooth.device_name);
		report_string_setting(75, driver_settings.bluetooth.service_name);
#endif
    }
}

void driver_settings_restore (uint8_t restore_flag)
{
    if(restore_flag & SETTINGS_RESTORE_DRIVER_PARAMETERS) {
    	driver_settings.wifi.ssid[0] = '\0';
    	driver_settings.wifi.password[0] = '\0';
    	driver_settings.wifi.port = 23;
    	strcpy(driver_settings.bluetooth.device_name, "GRBL");
    	strcpy(driver_settings.bluetooth.service_name, "GRBL Serial Port");
    	hal.eeprom.memcpy_to_with_checksum(hal.eeprom.driver_area.address, (uint8_t *)&driver_settings, sizeof(driver_settings));
    }
}

// Initialize HAL pointers, setup serial comms and enable EEPROM
// NOTE: Grbl is not yet configured (from EEPROM data), driver_setup() will be called when done
bool driver_init (void)
{
    // Enable EEPROM and serial port here for Grbl to be able to configure itself and report any errors

    uartInit();

    setUARTBlockingCallback(hal.serial_blocking_callback);

    hal.info = "ESP32";
    hal.driver_setup = driver_setup;
    hal.f_step_timer = rtc_clk_apb_freq_get() / STEPPER_DRIVER_PRESCALER;
    hal.rx_buffer_size = RX_BUFFER_SIZE;
    hal.delay_ms = driver_delay_ms;
    hal.settings_changed = settings_changed;

    hal.stepper_wake_up = stepperWakeUp;
    hal.stepper_go_idle = stepperGoIdle;
    hal.stepper_enable = stepperEnable;
    hal.stepper_set_outputs = stepperSetStepOutputs;
    hal.stepper_set_directions = stepperSetDirOutputs;
    hal.stepper_cycles_per_tick = stepperCyclesPerTick;
    hal.stepper_pulse_start = stepperPulseStart;

    hal.limits_enable = limitsEnable;
    hal.limits_get_state = limitsGetState;

    hal.coolant_set_state = coolantSetState;
    hal.coolant_get_state = coolantGetState;

    hal.probe_get_state = probeGetState;
    hal.probe_configure_invert_mask = probeConfigure;

    hal.spindle_set_state = spindleSetStateVariable;
    hal.spindle_get_state = spindleGetState;
    hal.spindle_set_speed = spindleSetSpeed;
    hal.spindle_compute_pwm_value = spindleComputePWMValue;

    hal.system_control_get_state = systemGetState;

    selectStream(StreamSetting_Serial);

#ifdef HAS_EEPROM
    eeprom_init();
    hal.eeprom.type = EEPROM_Physical;
    hal.eeprom.get_byte = eepromGetByte;
    hal.eeprom.put_byte = eepromPutByte;
    hal.eeprom.memcpy_to_with_checksum = eepromWriteBlockWithChecksum;
    hal.eeprom.memcpy_from_with_checksum = eepromReadBlockWithChecksum;
#else
    if(nvsInit()) {
        hal.eeprom.type = EEPROM_Emulated;
        hal.eeprom.size = GRBL_NVS_SIZE;
        hal.eeprom.memcpy_from_flash = nvsRead;
        hal.eeprom.memcpy_to_flash = nvsWrite;
		hal.eeprom.driver_area.address = GRBL_EEPROM_SIZE;
		hal.eeprom.driver_area.size = sizeof(driver_settings); // Add assert?
	} else
	    hal.eeprom.type = EEPROM_None;
#endif

    hal.driver_setting = user_defined_setting;
    hal.driver_settings_report = driver_settings_report;
    hal.driver_settings_restore = driver_settings_restore;

    hal.set_bits_atomic = bitsSetAtomic;
    hal.clear_bits_atomic = bitsClearAtomic;
    hal.set_value_atomic = valueSetAtomic;

    hal.show_message = showMessage;
#ifdef DEBUGOUT
    hal.debug_out = debug_out;
#endif

#ifdef SDCARD_ENABLE
    hal.driver_reset = sdcard_reset;
#endif

  // driver capabilities, used for announcing and negotiating (with Grbl) driver functionality

    hal.driver_cap.spindle_dir = On;
    hal.driver_cap.variable_spindle = On;
#ifdef PWM_RAMPED
    hal.driver_cap.spindle_at_speed = On;
#endif
    hal.driver_cap.mist_control = On;
    hal.driver_cap.software_debounce = On;
    hal.driver_cap.step_pulse_delay = On;
    hal.driver_cap.amass_level = 3;
    hal.driver_cap.control_pull_up = On;
    hal.driver_cap.limits_pull_up = On;
    hal.driver_cap.probe_pull_up = On;
#ifdef SDCARD_ENABLE
    hal.driver_cap.sd_card = On;
#endif
#ifdef BLUETOOTH_ENABLE
    hal.driver_cap.bluetooth = On;
#endif
#ifdef WIFI_ENABLE
    hal.driver_cap.wifi = On;
#endif

   // no need to move version check before init - compiler will fail any mismatch for existing entries
    return hal.version == 4;
}

/* interrupt handlers */

// Main stepper driver
IRAM_ATTR static void stepper_driver_isr (void *arg)
{
//	const int timer_idx = (int)arg;  // get the timer index

	TIMERG0.int_clr_timers.t0 = 1;
  	TIMERG0.hw_timer[STEP_TIMER_INDEX].config.alarm_en = TIMER_ALARM_EN;

    /* Resume the suspended task. */

    /* A context switch should now be performed so the ISR returns directly to
    the resumed task. This is because the resumed task had a priority that
    was equal to or higher than the task that is currently in the Running state.
    NOTE: The syntax required to perform a context switch from an ISR varies
    from port to port and from compiler to compiler. Check the
    documentation and examples for the port being used to find the syntax required by your
    application. It is likely that this if() statement can be replaced by a
    single call to portYIELD_FROM_ISR() [or portEND_SWITCHING_ISR()]
    using xYieldRequired as the macro parameter: portYIELD_FROM_ISR( xYieldRequired );*/

	hal.stepper_interrupt_callback();

//    if(xTaskResumeFromISR(xStepperTask) == pdTRUE)
//         portYIELD_FROM_ISR();
}

  //GPIO intr process
IRAM_ATTR static void gpio_isr (void *arg)
{
  bool debounce = false;
  uint8_t grp = 0;
  uint32_t intr_status[2];
  intr_status[0] = READ_PERI_REG(GPIO_STATUS_REG);			// get interrupt status for GPIO0-31
  intr_status[1] = READ_PERI_REG(GPIO_STATUS1_REG);			// get interrupt status for GPIO32-39
  SET_PERI_REG_MASK(GPIO_STATUS_W1TC_REG, intr_status[0]);  // clear intr for gpio0-gpio31
  SET_PERI_REG_MASK(GPIO_STATUS1_W1TC_REG, intr_status[1]);	// clear intr for gpio32-39

  uint32_t i = sizeof(inputpin) / sizeof(state_signal_t);
  do {
      i--;
	  if(intr_status[inputpin[i].offset] & inputpin[i].mask) {
		  if(inputpin[i].group == INPUT_GROUP_PROBE) // no debounce!
			  inputpin[i].active = true;
		  else if(inputpin[i].debounce)
    		  debounce = inputpin[i].active = true;
    	  else
    		  grp |= inputpin[i].group;
      }
  } while(i);

  if(debounce) {
      BaseType_t xHigherPriorityTaskWoken = pdFALSE;
      xTimerStartFromISR(debounceTimer, &xHigherPriorityTaskWoken);
  }

  if(grp & INPUT_GROUP_LIMIT)
	  hal.limit_interrupt_callback(limitsGetState());

  if(grp & INPUT_GROUP_CONTROL)
	  hal.control_interrupt_callback(systemGetState());
}
